console.log("Settings loaded");

const settings = {
  lang: {
    title: "Сфериум",
    hello: `Играют 2 человека, красными и синими. Нужно по очереди нажимать на грани, они будут менять цвет. Выигрывает тот, кто соберет вокруг какой-то грани 3 своего цвета. Чтобы вращать, нужно водить по экрану.`,
    winner3: "Ничья",
    winner1: "Выиграли красные",
    winner2: "Выиграли синие"
  },
  winningTriplets: [
    [4, 1, 6],
    [0, 2, 5],
    [9, 1, 3],
    [8, 2, 4],
    [3, 0, 7],
    [15, 1, 19],
    [16, 0, 15],
    [17, 4, 16],
    [18, 3, 17],
    [19, 2, 18],
    [15, 14, 11],
    [16, 10, 12],
    [13, 17, 11],
    [14, 18, 12],
    [10, 19, 13],
    [5, 10, 6],
    [7, 6, 11],
    [8, 7, 12],
    [9, 8, 13],
    [5, 9, 14]
  ],
  createSpheriumGeometry() {
    return new THREE.IcosahedronGeometry(10, 0);
  },
  colors: {
    neutral: 0x00ff00,
    player1: 0xff0000,
    player2: 0x0000ff
  }
};
